Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.ExecuteService(System.Guid,System.Guid,Autodesk.Revit.DB.ExternalService.IExternalData)
Execute the service by the given server.
Remarks:
Execution of a service should be invoked only by the application
that registered the service. The execution will use the given server.
The serverId must be of a valid server that is currently registered for the service, ArgumentException
be thrown if it is not available.
Because this method executes an explicitly specified server regardless of what other servers are
currently active, it can only be invoked for a service that is not set as being recordable.
Plese also note that this method does not have any effect on active servers currently set for the service.
executionKey:
Access key of the service to be executed.
The key is not the same as the service's Id. It is the value
that was returned to the caller who registered the service.
serverId:
the specific server to execute
data:
The associated data. The type must be of the class defined by the service.
Returns:
The result of executing the external service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The execution key is either invalid or of a service that is not registered.
To execute a service, the key returned by RegisterService method must be used.
-or-
The execution key is of a service that is already being executed.
-or-
The serverId is either invalid or or the server not registered to the service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The service is recordable. This method is intended for executing of non-recordable service.
-or-
The service provider is not available.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.ExecuteService(System.Guid,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalService.IExternalData)
Execute the service for the given document.
Remarks:
Execution of a service should be invoked only by the application
that registered the service. The execution will use the active server
(or servers in the case of a multi-server service) currently set for
the given document. If there is no server specifically set for the
document the current application-wide server (or servers) will be applied.
Please note that recordable services may only be executed in a document
that is currently modifiable. An exception will be thrown if it isn't so.
This requirement does not apply to non-recordable services.
This method is primarily intended for executing of recordable services,
for it is assumed that any changes made to the model during the service's
execution are likely tied with the service's currently active servers.
If the service was registered as non-recordable, changes to the model may
still be made, but the framework does not assume any explicit or implicit
correlations between the document changes and servers that caused them,
therefore it is not recorded which server did what. This fact is very important,
particularly in work-sharing environment. If it may happen that different
local users can have different servers installed and available, it is
imperative for a non-serialized service that its servers are completely
compatible with (or indifferent to) document modifications made by other
servers of the same service. The responsibility for complying with this
assumption is entirely on the service's provider.
executionKey:
Access key of the service to be executed.
The key is not the same as the service's Id. It is the value
that was returned to the caller who registered the service.
document:
The document for which the service is going to be executed.
data:
The associated data. The type must be of the class defined by the service.
Returns:
The result of executing the external service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The execution key is either invalid or of a service that is not registered.
To execute a service, the key returned by RegisterService method must be used.
-or-
The execution key is of a service that is already being executed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Executing a recordable service in a document that is not modifiable.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.ExecuteService(System.Guid,Autodesk.Revit.DB.ExternalService.IExternalData)
Execute a service independently of any document.
Remarks:
Execution of a service should be invoked only by the application
that registered the service. The execution will use the currently
active server (or servers in the case of a multi-server service).
This method does not take a document as one of its arguments
and therefore it is not intended for executions of recordable
services that may modify documents. If the service (recordable)
or its server(s) is expected to modify documents, the other ExecuteService
method -- the one that takes a document as one of its arguments -- is
supposed to be used.
Non-recordable services are free to modify documents during this
ExecuteService call, because activities of non-recordable services
are not recorded; the changes those services made are assumed to be
independent of the presence of the service and/or its servers.
executionKey:
Access key of the service to be executed.
The key is not the same as the service's Id. It is the value
that was returned to the caller who registered the service.
data:
The associated data. The type is defined by the service.
Returns:
The result of executing the external service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The execution key is either invalid or of a service that is not registered.
To execute a service, the key returned by RegisterService method must be used.
-or-
The execution key is of a service that is already being executed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.GetServices
Returns a collection of all external services currently registered in Revit.
Returns:
Array of ExternalService instances.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.GetService(Autodesk.Revit.DB.ExternalService.ExternalServiceId)
Returns an instance of an object that represents the external service with the given Id.
Remarks:
The returned instance is either of type SingleServerService or MultiServerService.
Users should cast the returned object to one of the classes if they need access to active servers.
serviceId:
Id of the service.
Returns:
The instance of the service or NULL if it cannot be found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.RegisterService(Autodesk.Revit.DB.ExternalService.ISingleServerService,System.Guid,Autodesk.Revit.DB.ExternalService.ExternalServiceOptions)
A method to register a mandatory, single-server service.
Remarks:
Each service can only be registered once. Revit checks the Id of every service
getting registered and throws an exception upon an attempt to register a service
with an Id that already exists.
Services need to be registered before Revit ends its initialization.
For external applications that means they have to register their services
during OnStartup. This will give servers which need to register to services
a chance to do so during the ApplicationInitialized event, which is raised
after a successfully processing OnStartup routines.
A service can be registered as either recordable or non-recordable.
It is expected that a service that is once registered as recordable
will always be registered as recordable. Failure to comply with this
policy may lead to data loss in some documents when they are opened
in a Revit session with the service currently registered as non-recordable.
A service is supposed to be executed only by the application that registered
it. To enforce this requirement, the registering method return an execution
key (a Guid) that is required as an argument to ExecuteService methods.
If the owner of a service allows executing it by anyone, it needs to register
it as a public service (via the option argument). Once registered as public,
The access key of the service can be obtained by any application, thus
it can also be executed by any application. By default, a service is registered
as private.
service:
An instance of the external service class that implements ISingleServerService interface.
defaultServerId:
Id of the server that will become the service's default server (once the server is registered).
options:
Optional settings to control the service's behavior.
Returns:
An access key to the service. The key is needed to execute the service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given service is not a valid implementation of ISingleServerService.
-or-
The given service does not return valid values from the interface methods.
At least one of the Name, VendorId, Description, and ServiceId is either empty or invalid.
-or-
A service with this Id is either invalid or not unique.
-or-
The given Id is not a valid GUID value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Service cannot be registered because the registry of services has been already closed.
All external services must be registered before the ApplicationInitialized event is raised.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.RegisterService(Autodesk.Revit.DB.ExternalService.IMultiServerService,Autodesk.Revit.DB.ExternalService.ExternalServiceOptions,Autodesk.Revit.DB.ExternalService.ExecutionPolicy)
A method to register a multi-server service.
Remarks:
Each service can only be registered once. Revit checks the Id of every service
getting registered and throws an exception upon an attempt to register a service
with an Id that already exists.
Services need to be registered before Revit ends its initialization.
For external applications that means they have to register their services
during OnStartup. This will give servers which need to register to services
a chance to do so during the ApplicationInitialized event, which is raised
after a successfully processing OnStartup routines.
A service can be registered as either recordable or non-recordable.
It is expected that a service that is once registered as recordable
will always be registered as recordable. Failure to comply with this
policy may lead to data loss in some documents when they are opened
in a Revit session with the service currently registered as non-recordable.
An application registering a service must specify a policy to follow when
executing the service. Once set, the policy remain constant during the
Revit session, but a different policy may be used next time, if there
is ever a need for such a change. More about the various execution policies
can be found in the description of the ExecutionPolicy enumerated type.
A service is supposed to be executed only by the application that registered
it. To enforce this requirement, the registering method return an execution
key (a Guid) that is required as an argument to ExecuteService methods.
If the owner of a service allows executing it by anyone, it needs to register
it as a public service (via the option argument). Once registered as public,
The access key of the service can be obtained by any application, thus
it can also be executed by any application. By default, a service is registered
as private.
service:
An instance of the external service class that implements IMultiServerService interface.
options:
Optional settings to control the service's behavior.
policy:
Specifies how the service handles servers during its execution.
Returns:
An execution key to access the service when executing it.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given service is not a valid implementation of ISingleServerService.
-or-
The given service does not return valid values from the interface methods.
At least one of the Name, VendorId, Description, and ServiceId is either empty or invalid.
-or-
A service with this Id is either invalid or not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Service cannot be registered because the registry of services has been already closed.
All external services must be registered before the ApplicationInitialized event is raised.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry.RegisterService(Autodesk.Revit.DB.ExternalService.ISingleServerService,Autodesk.Revit.DB.ExternalService.ExternalServiceOptions)
A method to register a single-server service.
Remarks:
Each service can only be registered once. Revit checks the Id of every service
getting registered and throws an exception upon an attempt to register a service
with an Id that already exists.
Services need to be registered before Revit ends its initialization.
For external applications that means they have to register their services
during OnStartup. This will give servers which need to register to services
a chance to do so during the ApplicationInitialized event, which is raised
after a successfully processing OnStartup routines.
A service can be registered as either recordable or non-recordable.
It is expected that a service that is once registered as recordable
will always be registered as recordable. Failure to comply with this
policy may lead to data loss in some documents when they are opened
in a Revit session with the service currently registered as non-recordable.
A service is supposed to be executed only by the application that registered
it. To enforce this requirement, the registering method return an execution
key (a Guid) that is required as an argument to ExecuteService methods.
If the owner of a service allows executing it by anyone, it needs to register
it as a public service (via the option argument). Once registered as public,
The access key of the service can be obtained by any application, thus
it can also be executed by any application. By default, a service is registered
as private.
service:
An instance of the external service class that implements ISingleServerService interface.
options:
Optional settings to control the service's behavior.
Returns:
An access key to the service. The key is needed to execute the service.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given service is not a valid implementation of ISingleServerService.
-or-
The given service does not return valid values from the interface methods.
At least one of the Name, VendorId, Description, and ServiceId is either empty or invalid.
-or-
A service with this Id is either invalid or not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Service cannot be registered because the registry of services has been already closed.
All external services must be registered before the ApplicationInitialized event is raised.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceRegistry
This class gives access to external services.
Use it to register external services with Revit and execute them.
Only the application that registers a service is allowed to execute it.
Since:
2013